In [7]:
from pandas import DataFrame
import json

In [17]:
# define data as json object inside string
raw_data = """
{
"city": ["Tripoli","Tripoli","Rome","Rome","Sydney", "Sydney"],
"rank": ["1st","2nd","1st","2nd","1st", "2nd"],
"name": ["Noureddin", "Adam", "Kevin", "Rihana", "Raghad", "Mahdi"],
"score1": [44,48,39,41,38,44],
"score2": [67,63,55,70,64,77]
}
"""

In [19]:
data = json.loads(raw_data)
data

{'city': ['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney'],
 'rank': ['1st', '2nd', '1st', '2nd', '1st', '2nd'],
 'name': ['Noureddin', 'Adam', 'Kevin', 'Rihana', 'Raghad', 'Mahdi'],
 'score1': [44, 48, 39, 41, 38, 44],
 'score2': [67, 63, 55, 70, 64, 77]}

In [22]:
data['name']

['Noureddin', 'Adam', 'Kevin', 'Rihana', 'Raghad', 'Mahdi']

In [23]:
data['name'][0]

'Noureddin'

In [24]:
json.dumps(data)

'{"city": ["Tripoli", "Tripoli", "Rome", "Rome", "Sydney", "Sydney"], "rank": ["1st", "2nd", "1st", "2nd", "1st", "2nd"], "name": ["Noureddin", "Adam", "Kevin", "Rihana", "Raghad", "Mahdi"], "score1": [44, 48, 39, 41, 38, 44], "score2": [67, 63, 55, 70, 64, 77]}'

In [26]:
df = DataFrame(data)
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd     Rihana      41      70
4   Sydney  1st     Raghad      38      64
5   Sydney  2nd      Mahdi      44      77